In [2]:
#importing libraries 
import pandas as pd
import numpy as np

In [3]:
#reading the "Bengaluru_House_Data" csv file
house_data = pd.read_csv("Bengaluru_House_Data.csv")

In [4]:
house_data

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

In [5]:
house_data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [6]:
#gives the total number of rows and columns
house_data.shape

(13320, 9)

## Data Cleaning

In [7]:
#gives the information of house_data
house_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [8]:
#find the number of values present in each column
for column in house_data.columns:
    print(house_data[column].value_counts())
    print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Jan               1
17-Jan               1
15-Jun               1
16-Oct               1
15-Aug               1
Name: availability, Length: 81, dtype: int64
********************
Whitefield             540
Sarjapur  Road         399
Electronic City        302
Kanakpura Road         273
Thanisandra            234
                      ...
Anathanagar              1
St Thomas Town           1
Banagirinagar            1
Whitefield ECC Road      1
Sree Narayana Nagar      1
Name: location, Length: 1305, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
18 Bedroom       1
13 BHK           1
27 BHK           1
16 BHK           1
12 Bedroom       1
43 Bedroom       1
14 BHK           1
19 BHK           1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Prtates    59
Sryalan    59
GMown E    56
           ..
Aaubyya     1
Esncyth     1
Miershi     1
Thessmm     1
Sryamar     1
Name: society, Length: 2688, dtype: int64
********************
1200               843
1100               221
1500               205
2400               196
600                180
                  ...
2172.65              1
1529                 1
2916                 1
142.84Sq. Meter      1
5108                 1
Name: total_sqft, Length: 2117, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
14.0       1
40.0       1
18.0       1
27.0       1
15.0       1
Name: bath, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
45.69       1
85.41       1
91.31       1
102.92      1
62.28       1
Name: price, Length: 1994, dtype: int64
********************

In [9]:
#check the null values present in the dataset 
house_data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [10]:
#since the columns area_type, availability, total_sqft and price doesnot contain null values we will remove thes columns
house_data.drop(columns=["area_type","availability","society","balcony"],inplace=True)

In [11]:
#describe the dataset
house_data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [12]:
house_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [13]:
house_data['location'].value_counts()

Whitefield             540
Sarjapur  Road         399
Electronic City        302
Kanakpura Road         273
Thanisandra            234
                      ...
Anathanagar              1
St Thomas Town           1
Banagirinagar            1
Whitefield ECC Road      1
Sree Narayana Nagar      1
Name: location, Length: 1305, dtype: int64

In [14]:
house_data['location']= house_data['location'].fillna('Sarjapur Road')

In [15]:
house_data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
18 Bedroom       1
13 BHK           1
27 BHK           1
16 BHK           1
12 Bedroom       1
43 Bedroom       1
14 BHK           1
19 BHK           1
Name: size, dtype: int64

In [16]:
house_data['size'] = house_data['size'].fillna('2 BHK')

In [17]:
house_data['bath'] = house_data['bath'].fillna(house_data['bath'].median())

In [18]:
house_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [19]:
house_data['bhk']= house_data['size'].str.split().str.get(0).astype(int)

In [20]:
house_data[house_data.bhk>20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [21]:
house_data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [22]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return(float(temp[0])* float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [23]:
house_data['total_sqft']= house_data['total_sqft'].apply(convertRange)

In [24]:
house_data.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [25]:
house_data['price_per_sqft']= house_data['price']*100000/house_data['total_sqft']

In [26]:
house_data['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [27]:
house_data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  1.327400e+04  13320.000000  13320.000000  13320.000000    1.327400e+04
mean   3.757339e+04      2.688814    112.565627      2.802778    7.829339e+03
std    4.748489e+05      1.338754    148.971674      1.294496    1.064333e+05
min    1.000000e+00      1.000000      8.000000      1.000000    1.180556e+00
25%    1.100000e+03      2.000000     50.000000      2.000000    4.210526e+03
50%    1.284000e+03      2.000000     72.000000      3.000000    5.412952e+03
75%    1.700000e+03      3.000000    120.000000      3.000000    7.288013e+03
max    1.606028e+07     40.000000   3600.000000     43.000000    1.200000e+07

In [28]:
house_data['location'].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
St Thomas Town                      1
Banagirinagar                       1
Whitefield ECC Road                 1
Neelasandra                         1
Bharath Housing Society Layout      1
Name: location, Length: 1306, dtype: int64

In [29]:
house_data['location'] = house_data['location'].apply(lambda x: x.strip())
location_count= house_data['location'].value_counts()

In [30]:
location_count

Whitefield               541
Sarjapur  Road           399
Electronic City          304
Kanakpura Road           273
Thanisandra              237
                        ...
N R Layout                 1
Nrupathunga Nagar          1
BEML Layout 5th Stage      1
Queens Road                1
Huttanahalli               1
Name: location, Length: 1295, dtype: int64

In [31]:
location_count_less10= location_count[location_count<=10]
location_count_less10

Sadashiva Nagar          10
Dairy Circle             10
Kalkere                  10
Naganathapura            10
Nagappa Reddy Layout     10
                         ..
N R Layout                1
Nrupathunga Nagar         1
BEML Layout 5th Stage     1
Queens Road               1
Huttanahalli              1
Name: location, Length: 1054, dtype: int64

In [32]:
house_data['location']= house_data['location'].apply(lambda x: 'other' if x in location_count_less10 else x)

In [33]:
house_data['location'].value_counts()

other                 2886
Whitefield             541
Sarjapur  Road         399
Electronic City        304
Kanakpura Road         273
                      ...
Kodigehalli             11
Pattandur Agrahara      11
Narayanapura            11
Marsur                  11
LB Shastri Nagar        11
Name: location, Length: 242, dtype: int64

In [34]:
house_data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  1.327400e+04  13320.000000  13320.000000  13320.000000    1.327400e+04
mean   3.757339e+04      2.688814    112.565627      2.802778    7.829339e+03
std    4.748489e+05      1.338754    148.971674      1.294496    1.064333e+05
min    1.000000e+00      1.000000      8.000000      1.000000    1.180556e+00
25%    1.100000e+03      2.000000     50.000000      2.000000    4.210526e+03
50%    1.284000e+03      2.000000     72.000000      3.000000    5.412952e+03
75%    1.700000e+03      3.000000    120.000000      3.000000    7.288013e+03
max    1.606028e+07     40.000000   3600.000000     43.000000    1.200000e+07

In [35]:
(house_data['total_sqft']/house_data['bhk']).describe()

count    1.327400e+04
mean     1.137245e+04
std      1.229315e+05
min      2.500000e-01
25%      4.750000e+02
50%      5.540000e+02
75%      6.280000e+02
max      4.015069e+06
dtype: float64

In [36]:
house_data= house_data[((house_data['total_sqft']/house_data['bhk'])>=300)]

In [37]:
house_data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  1.253000e+04  12530.000000  12530.000000  12530.000000    12530.000000
mean   3.974673e+04      2.559537    111.382401      2.650838     6221.175764
std    4.886582e+05      1.077938    152.077329      0.976678     4228.849601
min    3.000000e+02      1.000000      8.440000      1.000000        1.180556
25%    1.125000e+03      2.000000     49.000000      2.000000     4166.666667
50%    1.307500e+03      2.000000     70.000000      3.000000     5267.448444
75%    1.725000e+03      3.000000    115.000000      3.000000     6896.551724
max    1.606028e+07     16.000000   3600.000000     16.000000   176470.588235

In [38]:
house_data.shape

(12530, 7)

In [39]:
house_data['price_per_sqft'].describe()

count     12530.000000
mean       6221.175764
std        4228.849601
min           1.180556
25%        4166.666667
50%        5267.448444
75%        6896.551724
max      176470.588235
Name: price_per_sqft, dtype: float64

## Removing Outliers

In [40]:
def remove_outlier_sqft(df):
    df_op = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st= np.std(subdf.price_per_sqft)
        
        gen_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft <= (m+st))]
        df_op = pd.concat([df_op,gen_df],ignore_index= True)
    return df_op
house_data = remove_outlier_sqft(house_data)
house_data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  10425.000000  10425.000000  10425.000000  10425.000000    10425.000000
mean    1498.799769      2.468873     90.298665      2.571127     5633.876533
std      868.016942      0.970999     85.652717      0.892726     2272.364591
min      300.000000      1.000000      9.000000      1.000000     1250.000000
25%     1108.000000      2.000000     48.060000      2.000000     4200.000000
50%     1280.000000      2.000000     66.000000      2.000000     5147.058824
75%     1644.000000      3.000000    100.000000      3.000000     6423.034330
max    30400.000000     16.000000   2200.000000     16.000000    24509.803922

In [41]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk]= {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count':bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices,bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis="index")

In [42]:
house_data = bhk_outlier_remover(house_data)

In [43]:
house_data.shape

(7433, 7)

In [44]:
house_data

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,1st Block Jayanagar,4 BHK,2850.0,4.0,428.0,4,15017.543860
1,1st Block Jayanagar,3 BHK,1630.0,3.0,194.0,3,11901.840491
2,1st Block Jayanagar,3 BHK,1875.0,2.0,235.0,3,12533.333333
3,1st Block Jayanagar,3 BHK,1200.0,2.0,130.0,3,10833.333333
4,1st Block Jayanagar,2 BHK,1235.0,2.0,148.0,2,11983.805668
...,...,...,...,...,...,...,...
10416,other,2 BHK,1200.0,2.0,70.0,2,5833.333333
10417,other,1 BHK,1800.0,1.0,200.0,1,11111.111111
10420,other,2 BHK,1353.0,2.0,110.0,2,8130.081301
10421,other,1 Bedroom,812.0,1.0,26.0,1,3201.970443
10424,other,4 BHK,3600.0,5.0,400.0,4,11111.111111

In [45]:
house_data.drop(columns=['size','price_per_sqft'],inplace=True)

## Cleaned Data

In [46]:
house_data.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3
3  1st Block Jayanagar      1200.0   2.0  130.0    3
4  1st Block Jayanagar      1235.0   2.0  148.0    2

In [47]:
house_data.to_csv("Cleaned_data.csv")

In [48]:
X = house_data.drop(columns=['price'])
y = house_data['price']
print(X)

                  location  total_sqft  bath  bhk
0      1st Block Jayanagar      2850.0   4.0    4
1      1st Block Jayanagar      1630.0   3.0    3
2      1st Block Jayanagar      1875.0   2.0    3
3      1st Block Jayanagar      1200.0   2.0    3
4      1st Block Jayanagar      1235.0   2.0    2
...                    ...         ...   ...  ...
10416                other      1200.0   2.0    2
10417                other      1800.0   1.0    1
10420                other      1353.0   2.0    2
10421                other       812.0   1.0    1
10424                other      3600.0   5.0    4

[7433 rows x 4 columns]

In [49]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [50]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2, random_state = 0)

In [51]:
print(X_train.shape)
print(X_test.shape)
print(X)

(5946, 4)
(1487, 4)
                  location  total_sqft  bath  bhk
0      1st Block Jayanagar      2850.0   4.0    4
1      1st Block Jayanagar      1630.0   3.0    3
2      1st Block Jayanagar      1875.0   2.0    3
3      1st Block Jayanagar      1200.0   2.0    3
4      1st Block Jayanagar      1235.0   2.0    2
...                    ...         ...   ...  ...
10416                other      1200.0   2.0    2
10417                other      1800.0   1.0    1
10420                other      1353.0   2.0    2
10421                other       812.0   1.0    1
10424                other      3600.0   5.0    4

[7433 rows x 4 columns]

## Applying Linear Regression

In [52]:
column_trans= make_column_transformer((OneHotEncoder(sparse=False), ['location']),remainder='passthrough')

In [53]:
scaler= StandardScaler()

In [54]:
lr = LinearRegression(normalize=True)

In [55]:
pipe = make_pipeline(column_trans,scaler,lr)

In [56]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [57]:
y_pred = pipe.predict(X_test)

In [58]:
r2_score(y_test,y_pred)

0.8393561864022512

In [59]:
import pickle

In [60]:
pickle.dump(pipe, open('Linearregressionmodel.pk1','wb'))